---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.CustomInitialColor
source: html/1d2d43ad-dd2e-80fb-b27f-36dc0a470d27.htm
---
# CustomInitialColor Properties

Specifies whether the .NET object represents a valid Revit entity.